const data = {
  lnb: [
    {
      id: '1',
      name: 'SHE 경영정보',
      children: [
        {
          id: '1-1',
          name: '법규관리',
          children: [
            {
              id: '1-1-1',
              name: '법규자료 수집',
              children: [
                {
                  id: '1-1-1-1',
                  name: '법령분류 등록',
                  url: '/LawManagement/LawRegistration',
                },
                {
                  id: '1-1-1-2',
                  name: '법령 대상설정 등록',
                  url: '/LawManagement/LawTargetAdd',
                },
                { id: '1-1-1-3', name: '법령정보 I/F', url: '' },
                { id: '1-1-1-4', name: '제개정 여부확인', url: '' },
                { id: '1-1-1-5', name: '최신 법규자료 조회', url: '' },
                { id: '1-1-1-6', name: '법규자료 등록', url: '' },
                { id: '1-1-1-7', name: '변경 내역 통보', url: '' },
              ],
            },
            {
              id: '1-1-2',
              name: '법규자료 확인',
              children: [
                { id: '1-1-2-1', name: '법규정보 설정', url: '' },
                {
                  id: '1-1-2-2',
                  name: '신구조문 대비 및 법규 대응방안 등록',
                  url: '',
                },
              ],
            },
            {
              id: '1-1-3',
              name: '법규대응방안 수립 및 확정',
              children: [
                { id: '1-1-3-1', name: '부서의견 요청', url: '' },
                { id: '1-1-3-2', name: '부서의견 등록', url: '' },
                { id: '1-1-3-3', name: '법규 대응방안 확정', url: '' },
              ],
            },
            {
              id: '1-1-4',
              name: '법규현황 관리',
              children: [
                { id: '1-1-4-1', name: '법규 변경 이력 조회', url: '' },
              ],
            },
          ],
        },
        {
          id: '1-2',
          name: '목표관리',
          children: [
            {
              id: '1-2-1',
              name: 'SHE 목표수립',
              children: [
                { id: '1-2-1-1', name: 'SHE 목표수립', url: '' },
                { id: '1-2-1-2', name: 'SHE 목표대비 실적', url: '' },
                { id: '1-2-1-3', name: 'HSE KPI 목표 및 실적', url: '' },
                { id: '1-2-1-4', name: 'HSE KPI 월별 진척 현황 관리', url: '' },
              ],
            },
            {
              id: '1-2-2',
              name: '부서별 SHE 목표 및 세부목표 수립',
              children: [
                { id: '1-2-2-1', name: '부서별 SHE 목표 등록', url: '' },
                { id: '1-2-2-2', name: '부서별 달성계획 등록', url: '' },
                { id: '1-2-2-3', name: '부서별 달성실적 등록', url: '' },
              ],
            },
          ],
        },
        {
          id: '1-3',
          name: '교육관리',
          children: [
            {
              id: '1-3-1',
              name: 'SHE 교육 마스터',
              children: [
                { id: '1-3-1-1', name: '교육 기준정보', url: '' },
                { id: '1-3-1-2', name: '교육 대상자 관리', url: '' },
              ],
            },
            {
              id: '1-3-2',
              name: '연간 교육게획 수립',
              children: [
                { id: '1-3-2-1', name: '부서별 교육계획', url: '' },
                { id: '1-3-2-2', name: '전사 교육계획', url: '' },
              ],
            },
            {
              id: '1-3-3',
              name: '교육계획 및 결과 등록',
              children: [
                { id: '1-3-3-1', name: '교육계획 등록', url: '' },
                { id: '1-3-3-2', name: '교육결과 등록', url: '' },
              ],
            },
            {
              id: '1-3-4',
              name: '교육현황 조회',
              children: [
                { id: '1-3-4-1', name: '부서별 교육실적 조회', url: '' },
                { id: '1-3-4-2', name: '전사 교육실적 조회', url: '' },
                { id: '1-3-4-3', name: '개인별 이수 현황', url: '' },
              ],
            },
            {
              id: '1-3-5',
              name: '교육자료실',
              children: [
                { id: '1-3-5-1', name: '교육자료실 등록', url: '' },
                { id: '1-3-5-2', name: '교육자료실 조회', url: '' },
              ],
            },
          ],
        },
        {
          id: '1-4',
          name: '회의체 관리',
          children: [
            {
              id: '1-4-1',
              name: '회의체 관리',
              children: [
                { id: '1-4-1-1', name: '회의계획 등록', url: '' },
                { id: '1-4-1-2', name: '회의결과 등록', url: '' },
              ],
            },
          ],
        },
        {
          id: '1-5',
          name: '법정선해임 관리',
          children: [
            {
              id: '1-5-1',
              name: '선해임 관리',
              children: [{ id: '1-5-1-1', name: '선해임 관리', url: '' }],
            },
          ],
        },
        {
          id: '1-6',
          name: '자료실',
          children: [
            {
              id: '1-6-1',
              name: '자료실',
              children: [
                { id: '1-6-1-1', name: '자료실 등록(제안서용)', url: '' },
                { id: '1-6-1-2', name: '자료실 조회(제안서용)', url: '' },
              ],
            },
          ],
        },
        {
          id: '1-7',
          name: '작업공정 관리',
          children: [
            {
              id: '1-7-1',
              name: '작업공정 관리',
              children: [
                { id: '1-7-1-1', name: '작업공정 등록', url: '' },
                { id: '1-7-1-2', name: '작업공정별 취급물질 등록', url: '' },
              ],
            },
          ],
        },
      ],
    },
    {
      id: '2',
      name: '화학물질 관리',
      children: [
        {
          id: '2-1',
          name: '신규자재 SHE 평가',
          children: [
            {
              id: '2-1-1',
              name: '신규자재 SHE 평가',
              children: [
                { id: '2-1-1-1', name: '신규자재 SHE 평가요청 등록', url: '' },
                { id: '2-1-1-2', name: '신규자재 SHE 평가', url: '' },
                { id: '2-1-1-3', name: '신규자재 SHE 승인', url: '' },
                { id: '2-1-1-4', name: '신규자재 SHE 평가자 등록', url: '' },
                { id: '2-1-1-5', name: '최신 법규자료 조회', url: '' },
              ],
            },
          ],
        },
      ],
    },
    {
      id: '3',
      name: 'SHE심사·점검',
      children: [
        {
          id: '3-1',
          name: '사전 SHE 관리',
          children: [
            {
              id: '3-1-1',
              name: '사전 SHE 관리',
              children: [
                { id: '3-1-1-1', name: '심사기준 정보 등록', url: '' },
                { id: '3-1-1-2', name: 'U/T 기준정보 등록', url: '' },
                { id: '3-1-1-3', name: '사전 SHE 담당자 등록', url: '' },
                { id: '3-1-1-4', name: '사전 SHE 심사요청 등록', url: '' },
                { id: '3-1-1-5', name: '사전 SHE 심사검토 결과 등록', url: '' },
                { id: '3-1-1-6', name: '약식 SHE 심사요청 등록', url: '' },
                { id: '3-1-1-7', name: '약식 SHE 심사검토 결과 등록', url: '' },
                { id: '3-1-1-8', name: '사전 SHE 심사요청 등록(T)', url: '' },
                {
                  id: '3-1-1-9',
                  name: '사전 SHE 심사검토 결과 등록(T)',
                  url: '',
                },
                { id: '3-1-1-10', name: '약식 SHE 심사요청 등록(T)', url: '' },
                {
                  id: '3-1-1-11',
                  name: '약식 SHE 심사검토 결과 등록(T)',
                  url: '',
                },
                { id: '3-1-1-12', name: '사전 SHE 심사요청 등록(L)', url: '' },
                {
                  id: '3-1-1-13',
                  name: '사전 SHE 심사검토 결과 등록(L)',
                  url: '',
                },
              ],
            },
            {
              id: '3-1-2',
              name: '인허가 관리',
              children: [
                {
                  id: '3-1-2',
                  name: '인허가 관리',
                  children: [
                    { id: '3-1-2-1', name: '인허가 기준정보 등록', url: '' },
                    { id: '3-1-2-2', name: '인허가 등록', url: '' },
                  ],
                },
              ],
            },
            {
              id: '3-1-3',
              name: '사전 SHE 입고관리',
              children: [
                {
                  id: '3-1-3',
                  name: '사전 SHE 입고관리',
                  children: [
                    { id: '3-1-3-1', name: '사전 SHE 장비 입고 등록', url: '' },
                  ],
                },
              ],
            },
          ],
        },
        {
          id: '3-2',
          name: '가동전 SHE 관리',
          children: [
            {
              id: '3-2-1',
              name: '가동전 SHE 점검요청 등록',
              children: [
                { id: '3-2-1-1', name: '가동전 SHE 점검요청 등록', url: '' },
                { id: '3-2-1-2', name: '가동전 SHE 점검결과 등록', url: '' },
              ],
            },
          ],
        },
      ],
    },
    {
      id: '4',
      name: '안전관리',
      children: [
        {
          id: '4-1',
          name: '위험성평가 관리',
          children: [
            {
              id: '4-1-1',
              name: '위험성평가 계획',
              children: [
                {
                  id: '4-1-1-1',
                  name: '위험성평가 계획 등록 및 통보',
                  url: '',
                },
              ],
            },
            {
              id: '4-1-2',
              name: '공정위험성 평가',
              children: [
                { id: '4-1-2-1', name: '구성원 인적사항 등록', url: '' },
                { id: '4-1-2-2', name: '공정별 도면정보 등록', url: '' },
                { id: '4-1-2-3', name: '도면 구간정보 등록', url: '' },
                { id: '4-1-2-4', name: '구간별 가이드워드 등록', url: '' },
                { id: '4-1-2-5', name: 'HAZOP 분석', url: '' },
              ],
            },
            {
              id: '4-1-3',
              name: '작업위험성 평가',
              children: [
                { id: '4-1-3-1', name: '작업위험성 평가(JSA)', url: '' },
                {
                  id: '4-1-3-2',
                  name: '작업위험성 평가 개선계획 현황',
                  url: '',
                },
                { id: '4-1-3-3', name: '작업위험성 평가 결과 조회', url: '' },
                { id: '4-1-3-4', name: '업체 작업위험성 평가(JSA)', url: '' },
              ],
            },
            {
              id: '4-1-4',
              name: '화학물질위험성 평가',
              children: [{ id: '4-1-4-1', name: 'CHARM', url: '' }],
            },
          ],
        },
        {
          id: '4-2',
          name: '사전 SHE 변경관리',
          children: [
            {
              id: '4-2-1',
              name: '사전 SHE 변경관리 등록',
              children: [
                { id: '4-2-1-1', name: '사전 SHE 변경관리 등록', url: '' },
              ],
            },
          ],
        },
        {
          id: '4-3',
          name: 'PSM 이행점검',
          children: [
            {
              id: '4-3-1',
              name: 'PSM 이행점검',
              children: [
                { id: '4-3-1-1', name: '공정안전 기초자료 관리', url: '' },
                { id: '4-3-1-2', name: '공정안전 기초자료 관리(L)', url: '' },
                { id: '4-3-1-3', name: 'PSM 이행점검 기준정보 등록', url: '' },
                { id: '4-3-1-4', name: 'PSM 자체평가', url: '' },
              ],
            },
          ],
        },
        {
          id: '4-4',
          name: '안전작업 허가관리',
          children: [
            {
              id: '4-4-1',
              name: '기초정보',
              children: [
                { id: '4-4-1-1', name: '안전작업 허가 프로세스', url: '' },
                { id: '4-4-1-2', name: '작업별 준수사항 등록', url: '' },
                { id: '4-4-1-3', name: '사업장 이미지 등록', url: '' },
                { id: '4-4-1-4', name: '위치표시 아이콘 등록', url: '' },
              ],
            },
            {
              id: '4-4-2',
              name: '작업계획서 수립',
              children: [
                { id: '4-4-2-1', name: '작업계획서 수립 요청', url: '' },
                { id: '4-4-2-2', name: '작업계획서(업체) 등록', url: '' },
                { id: '4-4-2-3', name: '작업 전 현장(업체) 확인점검', url: '' },
                { id: '4-4-2-4', name: '작업승인서(업체) 조회', url: '' },
                { id: '4-4-2-5', name: '작업계획서 승인', url: '' },
                { id: '4-4-2-6', name: '작업계획서 등록(L)', url: '' },
              ],
            },
            {
              id: '4-4-3',
              name: '안전작업 허가서 관리',
              children: [
                {
                  id: '4-4-3-1',
                  name: '안전작업 허가서(업체) 등록 및 허가',
                  url: '',
                },
                { id: '4-4-3-2', name: '안전작업 허가서 협조', url: '' },
                { id: '4-4-3-3', name: '안전작업 공사현황', url: '' },
                { id: '4-4-3-4', name: '안전작업 허가서 실적등록', url: '' },
                {
                  id: '4-4-3-5',
                  name: '긴급 안전작업 허가서 실적 등록',
                  url: '',
                },
              ],
            },
            {
              id: '4-4-4',
              name: '안전작업 허가서 실적 관리',
              children: [
                { id: '4-4-4-1', name: '안전작업 허가서 실적 관리', url: '' },
              ],
            },
            {
              id: '4-4-5',
              name: '업체별 요청내역 조회',
              children: [
                { id: '4-4-5-1', name: '업체별 요청내역 조회', url: '' },
              ],
            },
            {
              id: '4-4-6',
              name: '공사 출입인원 조회',
              children: [
                { id: '4-4-6-1', name: '공사 출입인원 조회', url: '' },
              ],
            },
          ],
        },
        {
          id: '4-5',
          name: '사고관리',
          children: [
            {
              id: '4-5-1',
              name: '사고접수',
              children: [{ id: '4-5-1-1', name: '사고접수 관리', url: '' }],
            },
            {
              id: '4-5-2',
              name: 'One Sheet',
              children: [{ id: '4-5-2-1', name: 'One Sheet', url: '' }],
            },
            {
              id: '4-5-3',
              name: '사고 보고서 관리',
              children: [
                { id: '4-5-3-1', name: '사고보고서 조회 및 등록', url: '' },
                { id: '4-5-3-2', name: '사고보고서 조회 및 등록(L)', url: '' },
              ],
            },
            {
              id: '4-5-4',
              name: '사고 통계',
              children: [{ id: '4-5-4-1', name: '사고 통계', url: '' }],
            },
            {
              id: '4-5-5',
              name: '아차 사고',
              children: [{ id: '4-5-5-1', name: '아차 사고 관리', url: '' }],
            },
          ],
        },
        {
          id: '4-6',
          name: '협력업체 관리',
          children: [
            {
              id: '4-6-1',
              name: '협력업체 관리',
              children: [
                { id: '4-6-1-1', name: '평가항목 관리', url: '' },
                { id: '4-6-1-2', name: '협력업체 등록', url: '' },
                { id: '4-6-1-3', name: '협력업체 SHE 평가 및 결재', url: '' },
                { id: '4-6-1-4', name: '협력업체 등록 승인', url: '' },
                { id: '4-6-1-5', name: '협력업체 회원 승인', url: '' },
                { id: '4-6-1-6', name: '협력업체 탈퇴 승인', url: '' },
                { id: '4-6-1-7', name: '협력업체 사전평가 기준정보', url: '' },
                { id: '4-6-1-8', name: '협력업체 사전평가 등록', url: '' },
                { id: '4-6-1-9', name: '협력업체 평가 기준정보', url: '' },
                { id: '4-6-1-10', name: '협력업체 평가 등록', url: '' },
              ],
            },
          ],
        },
        {
          id: '4-7',
          name: '개선요청 및 조치관리',
          children: [
            {
              id: '4-7-1',
              name: '개선요청 및 조치관리',
              children: [
                { id: '4-7-1-1', name: '개선조치 요구 등록', url: '' },
                { id: '4-7-1-2', name: '개선요청 및 조치결과 통계', url: '' },
                { id: '4-7-1-3', name: '개선조치 요구 현황', url: '' },
              ],
            },
          ],
        },
        {
          id: '4-8',
          name: '점검일지 관리',
          children: [
            {
              id: '4-8-1',
              name: '점검일지 관리',
              children: [
                { id: '4-8-1-1', name: '점검일지 기준정보', url: '' },
                { id: '4-8-1-2', name: 'Safety Engineer 기준정보', url: '' },
                { id: '4-8-1-3', name: '위험경보제 기준정보', url: '' },
                { id: '4-8-1-4', name: '차량등록', url: '' },
                { id: '4-8-1-5', name: '차량관리 기준정보', url: '' },
                { id: '4-8-1-6', name: '위험물저장소 기준정보', url: '' },
                { id: '4-8-1-7', name: '위험물취급소 기준정보', url: '' },
                { id: '4-8-1-8', name: '소방일지 기준정보', url: '' },
                { id: '4-8-1-9', name: '점검일지', url: '' },
                { id: '4-8-1-10', name: 'Safety Engineer', url: '' },
                { id: '4-8-1-11', name: '위험경보제', url: '' },
                { id: '4-8-1-12', name: '차량관리', url: '' },
                { id: '4-8-1-13', name: '위험물저장소', url: '' },
                { id: '4-8-1-14', name: '위험물취급소', url: '' },
                { id: '4-8-1-15', name: '소방일지', url: '' },
                { id: '4-8-1-16', name: '순회점검일지', url: '' },
              ],
            },
          ],
        },
        {
          id: '4-9',
          name: '안전점검 관리',
          children: [
            {
              id: '4-9-1',
              name: '안전점검 관리',
              children: [
                { id: '4-9-1-1', name: '분류별 안점점검주기 설정', url: '' },
                { id: '4-9-1-2', name: 'Safety Engineer 기준정보', url: '' },
              ],
            },
          ],
        },
      ],
    },
    {
      id: '5',
      name: '보건관리',
      children: [
        {
          id: '5-1',
          name: '작업환경 측정관리',
          children: [
            {
              id: '5-1-1',
              name: '작업환경 측정',
              children: [
                { id: '5-1-1-1', name: '작업환경 공정별 물질정보', url: '' },
                { id: '5-1-1-2', name: '작업환경 측정결과 등록', url: '' },
                { id: '5-1-1-3', name: '작업환경 측정의뢰(수시)', url: '' },
                {
                  id: '5-1-1-4',
                  name: '작업환경 측정결과 등록(수시)',
                  url: '',
                },
              ],
            },
            {
              id: '5-1-2',
              name: '현황보고',
              children: [
                { id: '5-1-2-1', name: '작업환경 측정결과 조회', url: '' },
              ],
            },
          ],
        },
        {
          id: '5-2',
          name: '건강관리',
          children: [
            {
              id: '5-2-1',
              name: '종합검진 기준정보',
              children: [
                { id: '5-2-1-1', name: '부서등록', url: '' },
                { id: '5-2-1-2', name: '인사정보 등록', url: '' },
                { id: '5-2-1-3', name: '검진기관 정보', url: '' },
                { id: '5-2-1-4', name: '검진기관별 검진조건', url: '' },
                { id: '5-2-1-5', name: '검진기관별 검진항목', url: '' },
                { id: '5-2-1-6', name: '검진용 공정정보 등록', url: '' },
                { id: '5-2-1-7', name: '검진용 공정별 취급물질 등록', url: '' },
                { id: '5-2-1-8', name: '병원 근무자료 생성', url: '' },
                { id: '5-2-1-9', name: '병원 년 검진기간 지정', url: '' },
                { id: '5-2-1-10', name: '병원 근무자료 수정', url: '' },
                {
                  id: '5-2-1-11',
                  name: '종합검진 휴진일자 등록(병원용)',
                  url: '',
                },
                {
                  id: '5-2-1-12',
                  name: '일자별 검진 인원 변경(병원용)',
                  url: '',
                },
              ],
            },
            {
              id: '5-2-2',
              name: '종합검진 예약관리',
              children: [
                { id: '5-2-2-1', name: '검진대상 선정', url: '' },
                { id: '5-2-2-2', name: '검진대상 선정(L)', url: '' },
                { id: '5-2-2-3', name: '종합검진 예약', url: '' },
                { id: '5-2-2-4', name: '여성검진 예약', url: '' },
                { id: '5-2-2-5', name: '종합검진 예약조회', url: '' },
                { id: '5-2-2-6', name: '건강검진 예약취소', url: '' },
                { id: '5-2-2-7', name: '건강검진 예약변경', url: '' },
                { id: '5-2-2-8', name: '건강검진 예약변경(병원용)', url: '' },
                { id: '5-2-2-9', name: '건강검진 진행관리', url: '' },
                { id: '5-2-2-10', name: '종합검진 기관별 예약현황', url: '' },
              ],
            },
            {
              id: '5-2-3',
              name: '배치관리',
              children: [
                {
                  id: '5-2-3-1',
                  name: '공정별 근무자 등록(배치검진)',
                  url: '',
                },
                { id: '5-2-3-2', name: '배치변경 처리', url: '' },
                { id: '5-2-3-3', name: '배치 전 대상자 관리', url: '' },
                { id: '5-2-3-4', name: '배치 후 대상자 관리', url: '' },
                { id: '5-2-3-5', name: '배치변경 검진결과 관리', url: '' },
              ],
            },
            {
              id: '5-2-4',
              name: '검진관리',
              children: [
                { id: '5-2-4-1', name: '일반/특수검진 대상자', url: '' },
                { id: '5-2-4-2', name: '일반/특수검진 대상자(L)', url: '' },
                { id: '5-2-4-3', name: '검진기관 등록(병원용)', url: '' },
                {
                  id: '5-2-4-4',
                  name: '종합검진 진행내역 처리(병원용)',
                  url: '',
                },
              ],
            },
            {
              id: '5-2-5',
              name: '건강검진 결과관리',
              children: [
                {
                  id: '5-2-5-1',
                  name: '검진결과 조회 및 면담내용 등록',
                  url: '',
                },
                {
                  id: '5-2-5-2',
                  name: '검진결과 조회 및 면담내용 등록(L)',
                  url: '',
                },
                { id: '5-2-5-3', name: '유소견자 대상 등록', url: '' },
                { id: '5-2-5-4', name: '유소견자 대상 등록(L)', url: '' },
                { id: '5-2-5-5', name: '유소견자 SMS 메일 등록', url: '' },
                { id: '5-2-5-6', name: '유소견자 상담 등록', url: '' },
              ],
            },
            {
              id: '5-2-6',
              name: '의약품 기준정보',
              children: [
                { id: '5-2-6-1', name: '의약품 기준정보', url: '' },
                { id: '5-2-6-2', name: '의약품 입고/반품', url: '' },
                { id: '5-2-6-3', name: '의약품 불출관리', url: '' },
                { id: '5-2-6-4', name: '의약품 불출현황', url: '' },
                { id: '5-2-6-5', name: '의약품 수불현황', url: '' },
                { id: '5-2-6-6', name: '의약품 수불 집계현황', url: '' },
              ],
            },
          ],
        },
        {
          id: '5-3',
          name: '재해자 관리',
          children: [
            {
              id: '5-3-1',
              name: '재해자 관리',
              children: [{ id: '5-3-1-1', name: '재해자 면담 등록', url: '' }],
            },
          ],
        },
        {
          id: '5-4',
          name: '안전보호구 관리',
          children: [
            {
              id: '5-4-1',
              name: '안전보호구 관리',
              children: [
                { id: '5-4-1-1', name: '안전보호구 등록', url: '' },
                { id: '5-4-1-2', name: '안전보호구 보관장소 등록', url: '' },
                { id: '5-4-1-3', name: '안전보호구 물품지급', url: '' },
                { id: '5-4-1-4', name: '안전보호구 실사등록', url: '' },
                { id: '5-4-1-5', name: '안전보호구 실사조회', url: '' },
                {
                  id: '5-4-1-6',
                  name: '개인별 안전보호구 지급내역 조회',
                  url: '',
                },
                {
                  id: '5-4-1-7',
                  name: '보관장소별 안전보호구 지급내역 조회',
                  url: '',
                },
              ],
            },
          ],
        },
        {
          id: '5-5',
          name: '근골격계 관리',
          children: [
            {
              id: '5-5-1',
              name: '근골격계 관리',
              children: [
                { id: '5-5-1-1', name: '근골격계 부담작업 등록', url: '' },
                { id: '5-5-1-2', name: '유해요인 조사표 등록', url: '' },
                { id: '5-5-1-3', name: '작업조건조사 등록', url: '' },
                { id: '5-5-1-4', name: '유해요인 평가 등록', url: '' },
                { id: '5-5-1-45', name: '작업분석 평가 결과표 등록', url: '' },
              ],
            },
          ],
        },
        {
          id: '5-6',
          name: '뇌심혈관 관리',
          children: [
            {
              id: '5-6-1',
              name: '예방자료실 등록',
              children: [
                { id: '5-6-1-1', name: '예방자료실 등록회', url: '' },
                { id: '5-6-1-2', name: '예방자료실 조회', url: '' },
                { id: '5-6-1-3', name: '평가대상 선정', url: '' },
                { id: '5-6-1-4', name: '문진표 작성', url: '' },
                { id: '5-6-1-5', name: '종합조사표 작성', url: '' },
                {
                  id: '5-6-1-6',
                  name: '위험도판정 및 업무적합성 평가',
                  url: '',
                },
                { id: '5-6-1-7', name: 'Push Message 전송이력 조회', url: '' },
              ],
            },
          ],
        },
        {
          id: '5-7',
          name: '보건일지',
          children: [
            {
              id: '5-7-1',
              name: '보건일지',
              children: [{ id: '5-7-1-1', name: '보건일지', url: '' }],
            },
          ],
        },
        {
          id: '5-8',
          name: '물질별 안전보호구 관리',
          children: [
            {
              id: '5-8-1',
              name: '물질별 안전보호구 등록',
              children: [
                { id: '5-8-1-1', name: '물질별 안전보호구 등록', url: '' },
                { id: '5-8-1-2', name: '물질별 안전보호구 조회', url: '' },
              ],
            },
          ],
        },
        {
          id: '5-9',
          name: '특별관리물질',
          children: [
            {
              id: '5-9-1',
              name: '특별관리물질 등록',
              children: [
                { id: '5-9-1-1', name: '부서별 특별관리물질 등록', url: '' },
                { id: '5-9-1-2', name: '특별관리물질 고지', url: '' },
                { id: '5-9-1-3', name: '특별관리물질 입고 등록', url: '' },
                { id: '5-9-1-4', name: '특별관리물질 출고 등록', url: '' },
                { id: '5-9-1-5', name: '특별관리물질 입출고 현황', url: '' },
                { id: '5-9-1-6', name: '특별관리물질 취급일지', url: '' },
                { id: '5-9-1-7', name: '특별관리물질 LIST', url: '' },
              ],
            },
          ],
        },
      ],
    },
    {
      id: '6',
      name: '환경관리',
      children: [
        {
          id: '6-1',
          name: '환경기준정보 관리',
          children: [
            {
              id: '6-1-1',
              name: '환경기준정보 관리',
              children: [
                { id: '6-1-1-1', name: '기초정보 등록', url: '' },
                { id: '6-1-1-2', name: '기초정보 등록(담당자용)', url: '' },
              ],
            },
          ],
        },
        {
          id: '6-2',
          name: '대기관리',
          children: [
            {
              id: '6-2-1',
              name: '시설관리',
              children: [
                { id: '6-2-1-1', name: '배출구 정보', url: '' },
                { id: '6-2-1-2', name: '방지시설 정보', url: '' },
                { id: '6-2-1-3', name: '배출시설 정보', url: '' },
              ],
            },
            {
              id: '6-2-2',
              name: '운영일지',
              children: [
                { id: '6-2-2-1', name: '대기운영 일지', url: '' },
                { id: '6-2-2-2', name: '약품 사용현황', url: '' },
              ],
            },
            {
              id: '6-2-3',
              name: '자가측정',
              children: [
                { id: '6-2-3-1', name: '자가측정 등록', url: '' },
                { id: '6-2-3-2', name: '자가측정 현황', url: '' },
              ],
            },
            {
              id: '6-2-4',
              name: '배출현황',
              children: [{ id: '6-2-4-1', name: '오염물질 배출현황', url: '' }],
            },
          ],
        },
        {
          id: '6-3',
          name: '수질관리',
          children: [
            {
              id: '6-3-1',
              name: '운영일지',
              children: [{ id: '6-3-1-1', name: '수질운영 관리', url: '' }],
            },
            {
              id: '6-3-2',
              name: '약품사용',
              children: [{ id: '6-3-2-1', name: '약품사용량 조회', url: '' }],
            },
            {
              id: '6-3-3',
              name: '자가측정',
              children: [{ id: '6-3-3-1', name: '자가측정 등록', url: '' }],
            },
            {
              id: '6-3-4',
              name: '수질농도 현황',
              children: [
                { id: '6-3-4-1', name: '수질농도 현황', url: '' },
                { id: '6-3-4-2', name: '수질농도 현황2', url: '' },
              ],
            },
            {
              id: '6-3-5',
              name: '배출현황',
              children: [
                { id: '6-3-5-1', name: '폐수배출량 현황', url: '' },
                { id: '6-3-5-2', name: '오염물질 배출현황', url: '' },
                { id: '6-3-5-3', name: '오염물질 배출현황(kg)', url: '' },
              ],
            },
          ],
        },
        {
          id: '6-4',
          name: '페기물 관리',
          children: [
            {
              id: '6-4-1',
              name: '폐기물 관리',
              children: [{ id: '6-4-1-1', name: '폐기물정보 관리', url: '' }],
            },
          ],
        },
        {
          id: '6-5',
          name: '환경영향평가',
          children: [
            {
              id: '6-5-1',
              name: '환경영향평가',
              children: [
                { id: '6-5-1-1', name: '기초정보 등록', url: '' },
                { id: '6-5-1-2', name: '환경영향평가 등록', url: '' },
                { id: '6-5-1-3', name: '개선진행 상세현황', url: '' },
              ],
            },
          ],
        },
        {
          id: '6-6',
          name: '온실가스 관리',
          children: [
            {
              id: '6-6-1',
              name: '온실가스 관리',
              children: [
                { id: '6-6-1-1', name: '에너지 산화계수 등록', url: '' },
                { id: '6-6-1-2', name: '에너지 열량환산기준 등록', url: '' },
                { id: '6-6-1-3', name: '전기 배출계수 등록', url: '' },
                { id: '6-6-1-4', name: '전기 열량환산기준 등록', url: '' },
                { id: '6-6-1-5', name: '스팀 배출계수 등록', url: '' },
                { id: '6-6-1-6', name: '온실가스 배출량 산정', url: '' },
              ],
            },
          ],
        },
      ],
    },
    {
      id: '7',
      name: '설비관리',
      children: [
        {
          id: '7-1',
          name: '기준정보',
          children: [
            {
              id: '7-1-1',
              name: '기준정보',
              children: [
                { id: '7-1-1-1', name: '설비그룹 등록', url: '' },
                { id: '7-1-1-2', name: '설비마스타 등록', url: '' },
                { id: '7-1-1-3', name: '설비 관리대장', url: '' },
              ],
            },
          ],
        },
        {
          id: '7-2',
          name: '설비관리',
          children: [
            {
              id: '7-2-1',
              name: '설비관리',
              children: [
                { id: '7-2-1-1', name: '설비점검 기준등록', url: '' },
                { id: '7-2-1-2', name: '설비예방/예측 계획 등록', url: '' },
                { id: '7-2-1-3', name: '설비예방/예측 실적 등록', url: '' },
                { id: '7-2-1-4', name: '설비점검 기준표 현황', url: '' },
                { id: '7-2-1-5', name: '년간 설비점검 계획 현황', url: '' },
                { id: '7-2-1-6', name: '월간 예방/예측 실적 현황', url: '' },
                { id: '7-2-1-7', name: '예방/예측 스케줄링', url: '' },
              ],
            },
          ],
        },
      ],
    },
    {
      id: '8',
      name: 'SHE 모니터링',
      children: [
        {
          id: '8-1',
          name: '모니터링',
          children: [
            {
              id: '8-1-1',
              name: '모니터링',
              children: [
                { id: '8-1-1-1', name: '사고 모니터링', url: '' },
                { id: '8-1-1-2', name: '공사 모니터링', url: '' },
                { id: '8-1-1-3', name: '대기 모니터링', url: '' },
                { id: '8-1-1-4', name: '수질 모니터링', url: '' },
                { id: '8-1-1-5', name: '폐기물 모니터링', url: '' },
              ],
            },
          ],
        },
        {
          id: '8-2',
          name: '일정관리',
          children: [
            {
              id: '8-1-1',
              name: '일정관리',
              children: [{ id: '8-1-1-1', name: '주간 일정 등록', url: '' }],
            },
          ],
        },
        {
          id: '8-3',
          name: '공지사항',
          children: [
            {
              id: '8-3-1',
              name: '공지사항',
              children: [{ id: '8-3-1-1', name: '공지사항 등록', url: '' }],
            },
          ],
        },
      ],
    },
    {
      id: '9',
      name: '시스템',
      children: [
        {
          id: '9-1',
          name: '시스템 관리',
          children: [
            {
              id: '9-1-1',
              name: '시스템 관리',
              children: [
                { id: '9-1-1-1', name: '그룹권한 등록', url: '' },
                { id: '9-1-1-2', name: '프로그램 등록', url: '' },
                { id: '9-1-1-3', name: '그룹 메뉴 등록', url: '' },
                { id: '9-1-1-4', name: '사용자별 그룹권한 등록', url: '' },
                {
                  id: '9-1-1-5',
                  name: '사용자별 그룹권한 등록(협력업체)',
                  url: '',
                },
                {
                  id: '9-1-1-6',
                  name: '사용자 상태/암호 변경(협력업체)',
                  url: '',
                },
                { id: '9-1-1-7', name: '문서별 전자결재 결재선 등록', url: '' },
                { id: '9-1-1-8', name: '엑셀 업로드 환경 등록', url: '' },
                { id: '9-1-1-9', name: 'SHE 기준정보', url: '' },
                { id: '9-1-1-10', name: 'SHE 기준정보(SHE 담당자용)', url: '' },
                {
                  id: '9-1-1-11',
                  name: '프로그램 사용이력 현황(사내)',
                  url: '',
                },
                {
                  id: '9-1-1-12',
                  name: '프로그램 사용이력 현황(협력업체)',
                  url: '',
                },
                { id: '9-1-1-13', name: 'SQL 역변환', url: '' },
                { id: '9-1-1-14', name: 'SQL 변환(jsp 생성)-MSSQL', url: '' },
                { id: '9-1-1-15', name: 'DB 사용자 암호화', url: '' },
                { id: '9-1-1-16', name: '개발 참고자료', url: '' },
                {
                  id: '9-1-1-17',
                  name: '메일전송 테스트(한화솔루션)',
                  url: '',
                },
                {
                  id: '9-1-1-18',
                  name: '전자결재 테스트(한화솔루션)',
                  url: '',
                },
                {
                  id: '9-1-1-19',
                  name: 'UBI HTML/PDF 파일생성 테스트',
                  url: '',
                },
                {
                  id: '9-1-1-20',
                  name: '전자결재 상태값 전송 테스트(전자정부)',
                  url: '',
                },
                { id: '9-1-1-21', name: 'SAP I/F TEST', url: '' },
                { id: '9-1-1-22', name: '정부용 MSSQL 생성', url: '' },
                { id: '9-1-1-23', name: '정부용 CLASS 생성', url: '' },
                { id: '9-1-1-24', name: 'SCM용', url: '' },
              ],
            },
            {
              id: '9-1-2',
              name: '프로그램 버전관리',
              children: [
                { id: '9-1-2-1', name: '작업요청(W/O) I/F', url: '' },
                { id: '9-1-2-2', name: '구매발주(P/O) I/F', url: '' },
                { id: '9-1-2-3', name: '공사업체 안전교육 등록', url: '' },
                { id: '9-1-2-4', name: '작업내용 변경교육 등록', url: '' },
                { id: '9-1-2-5', name: '투자품의 내역', url: '' },
                { id: '9-1-2-6', name: '투자종결보고 내역', url: '' },
                { id: '9-1-2-7', name: '공사완료보고 등록', url: '' },
                { id: '9-1-2-8', name: '사전SHE 심사요청 등록', url: '' },
                { id: '9-1-2-9', name: '사전SHE 심사검토 결과 등록', url: '' },
                { id: '9-1-2-10', name: '사전SHE 변경관리 등록', url: '' },
                { id: '9-1-2-11', name: '인허가등록', url: '' },
                { id: '9-1-2-12', name: '가동전SHE 점검요청 등록', url: '' },
                { id: '9-1-2-13', name: '가동전SHE 점검결과 등록', url: '' },
                { id: '9-1-2-14', name: '작업계획서(업체) 등록', url: '' },
                {
                  id: '9-1-2-15',
                  name: '안전작업허가서(업체) 등록 및 허가',
                  url: '',
                },
                { id: '9-1-2-16', name: '안전작업 허가서 실적등록', url: '' },
                { id: '9-1-2-17', name: '공정안전 기초자료 관리', url: '' },
                { id: '9-1-2-18', name: '작업위험성평가(JSA)', url: '' },
                { id: '9-1-2-19', name: '협력업체 평가 등록', url: '' },
                { id: '9-1-2-20', name: '코로나19 유증상자 관리', url: '' },
                { id: '9-1-2-21', name: '작업환경측정 결과', url: '' },
                { id: '9-1-2-22', name: '작업환경측정 예비조사', url: '' },
                {
                  id: '9-1-2-23',
                  name: '건강상담 예야굼낮 발송 및 기록관리',
                  url: '',
                },
              ],
            },
            {
              id: '9-1-3',
              name: '직무스트레스 관리',
              children: [
                {
                  id: '9-1-1-1',
                  name: '직무스트레스 설문 기초자료 등록',
                  url: '',
                },
                { id: '9-1-1-2', name: '직무스트레스 설문지 등록', url: '' },
                { id: '9-1-1-3', name: '직무스트레스 결과', url: '' },
                { id: '9-1-1-4', name: '직무스트레스 결과 관리', url: '' },
              ],
            },
            {
              id: '9-1-4',
              name: 'EHS 기준정보',
              children: [
                { id: '9-1-4-1', name: 'SHE 기준정보', url: '' },
                { id: '9-1-4-2', name: '부서 등록', url: '' },
                { id: '9-1-4-3', name: '인사정보 등록', url: '' },
                { id: '9-1-4-4', name: '작업공정 등록', url: '' },
                { id: '9-1-4-5', name: '작업공정별 취급물질 등록', url: '' },
              ],
            },
            {
              id: '9-1-5',
              name: '한화솔루션 프로토타입',
              children: [
                { id: '9-1-5-1', name: '변경관리 판정 기준정보', url: '' },
                {
                  id: '9-1-5-2',
                  name: '환경안전검토서 세부 기준정보',
                  url: '',
                },
                { id: '9-1-5-3', name: '환경안전검토 기준정보', url: '' },
                { id: '9-1-5-4', name: '변경관리 판정표', url: '' },
                { id: '9-1-5-5', name: '변경관리 판정표 승인', url: '' },
                {
                  id: '9-1-5-6',
                  name: '변경요구서 검토항목 기준정보',
                  url: '',
                },
                { id: '9-1-5-7', name: '설계위험성평가-HAZOP', url: '' },
                { id: '9-1-5-8', name: '설계위험성평가-JSA', url: '' },
                { id: '9-1-5-9', name: '변경위원회 심의결과 등록', url: '' },
                { id: '9-1-5-10', name: '변경요구서 등록', url: '' },
                { id: '9-1-5-11', name: '환경안전 사전 검토서', url: '' },
                { id: '9-1-5-12', name: '환경안전 사전 검토서 승인', url: '' },
                { id: '9-1-5-13', name: '환경안전검토서 등록', url: '' },
                { id: '9-1-5-14', name: '협력업체 등록', url: '' },
                {
                  id: '9-1-5-15',
                  name: '공사업체 계약전평가 산정 기준정보',
                  url: '',
                },
                {
                  id: '9-1-5-16',
                  name: '공사업체 계약전평가 산정 등록',
                  url: '',
                },
                {
                  id: '9-1-5-17',
                  name: '공사업체 계약전평가 기준정보',
                  url: '',
                },
                { id: '9-1-5-18', name: '공사업체 계약전평가 등록', url: '' },
                {
                  id: '9-1-5-19',
                  name: '공사업체 서류 제출 기준정보',
                  url: '',
                },
                { id: '9-1-5-20', name: '공사업체 서류 재출', url: '' },
                { id: '9-1-5-21', name: '공사업체 서류 제출 승인', url: '' },
                { id: '9-1-5-22', name: '공사업체 출입의뢰', url: '' },
                { id: '9-1-5-23', name: '공사업체 출입승인', url: '' },
                { id: '9-1-5-24', name: '공사업체 안전교육', url: '' },
                {
                  id: '9-1-5-25',
                  name: '공사(작업)위험성평가-유해위험요인',
                  url: '',
                },
                { id: '9-1-5-26', name: '공사(작업)위험성평가', url: '' },
                { id: '9-1-5-27', name: '공사(작업)위험성평가 승인', url: '' },
                {
                  id: '9-1-5-28',
                  name: '변경요구 자료 등록(업데이트)',
                  url: '',
                },
                {
                  id: '9-1-5-29',
                  name: '가동전점검 Check List 기준정보',
                  url: '',
                },
                { id: '9-1-5-30', name: '가동전점검 Check List', url: '' },
                { id: '9-1-5-31', name: '변경교육(내부)', url: '' },
                { id: '9-1-5-32', name: '공사완료보고서 등록', url: '' },
                { id: '9-1-5-33', name: '공정변경 종결보고서 등록', url: '' },
                { id: '9-1-5-34', name: '공사업체 사후평가 기준정보', url: '' },
                { id: '9-1-5-35', name: '공사업체 사후평가 등록', url: '' },
                { id: '9-1-5-36', name: '공사업체 사후평가 전자결재', url: '' },
                { id: '9-1-5-37', name: '공사업체 재평가 기준정보', url: '' },
                { id: '9-1-5-38', name: '공사업체 재평가 등록', url: '' },
                { id: '9-1-5-39', name: '변경관리 Tracking 조회', url: '' },
              ],
            },
          ],
        },
      ],
    },
  ],
};

export default data;
